DATA EXPLORATION

In [6]:
import warnings
warnings.filterwarnings("ignore")

In [7]:
import pandas as pd

df = pd.read_csv("raw.csv")

In [21]:
df.dtypes

year                   int64
month                 object
circle                object
type_of_connection    object
service_provider      object
value                 object
unit                  object
notes                 object
dtype: object

In [14]:
len(df)

70728

In [22]:
df.columns.tolist()

['year',
 'month',
 'circle',
 'type_of_connection',
 'service_provider',
 'value',
 'unit',
 'notes']

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70728 entries, 0 to 70727
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year                70728 non-null  int64
 1   month               70728 non-null  object
 2   circle              70728 non-null  object
 3   type_of_connection  70728 non-null  object
 4   service_provider    70728 non-null  object
 5   value               58396 non-null  object
 6   unit                70728 non-null  object
 7   notes               511 non-null    object
dtypes: int64(1), object(7)
memory usage: 4.3+ MB

In [19]:
print(df['year'].max())
print(df['year'].min())

2025
2009

In [23]:
print(f"Unique operators: {df['service_provider'].nunique()}")

Unique operators: 42

In [24]:
print(f"Date range: {df['year'].min()} - {df['year'].max()}")

Date range: 2009 - 2025

In [28]:
print(f"Unique circles: {df['circle'].nunique()}")

Unique circles: 38

In [29]:
print(f"Unique circles: {df['circle'].unique()}")

Unique circles: ['Andhra Pradesh' 'Assam' 'Bihar' 'Delhi' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu and Kashmir' 'Karnataka' 'Kerala' 'Kolkata'
 'Madhya Pradesh' 'Maharashtra' 'Mumbai' 'North East' 'Odisha' 'Punjab'
 'Rajasthan' 'Tamil Nadu' 'Uttar Pradesh (East)' 'Uttar Pradesh (West)'
 'West Bengal' 'All India' 'All india' 'Tamil Nadu (including Chennai)'
 'Chennai' 'Andaman and Nicobar Islands' 'Arunachal Pradesh'
 'Chhattisgarh' 'Jharkhand' 'Uttarakhand' 'North East 1' 'North East 2'
 'North East2' 'North East1' 'Chattisgarh' 'Andaman and Nicobar'
 'Uttaranchal']

In [30]:
df.nunique()

year                     17
month                    12
circle                   38
type_of_connection        2
service_provider         42
value                 47600
unit                      1
notes                    69
dtype: int64

In [9]:
df.head()

,year,month,circle,type_of_connection,service_provider,value,unit,notes
0,2025,April,Andhra Pradesh,wireless,Bharti Airtel (Including Tata Tele.),33965795,value in absolute number,NaN
1,2025,April,Assam,wireless,Bharti Airtel (Including Tata Tele.),12314102,value in absolute number,NaN
2,2025,April,Bihar,wireless,Bharti Airtel (Including Tata Tele.),40967773,value in absolute number,NaN
3,2025,April,Delhi,wireless,Bharti Airtel (Including Tata Tele.),18877637,value in absolute number,NaN
4,2025,April,Gujarat,wireless,Bharti Airtel (Including Tata Tele.),12401101,value in absolute number,NaN

In [10]:
df.tail()

,year,month,circle,type_of_connection,service_provider,value,unit,notes
70723,2009,January,Uttar Pradesh (East),wireline,BSNL,1440296.0,value in absolute number,NaN
70724,2009,January,Uttar Pradesh (West),wireline,BSNL,940266.0,value in absolute number,NaN
70725,2009,January,Uttaranchal,wireline,BSNL,300884.0,value in absolute number,NaN
70726,2009,January,West Bengal,wireline,BSNL,1038499.0,value in absolute number,NaN
70727,2009,January,All India,wireline,BSNL,29291013.0,value in absolute number,NaN

In [11]:
df.describe()

               year
count  70728.000000
mean    2016.026298
std        4.748129
min     2009.000000
25%     2012.000000
50%     2016.000000
75%     2020.000000
max     2025.000000

In [40]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
70723    False
70724    False
70725    False
70726    False
70727    False
Length: 70728, dtype: bool

In [12]:
df.isnull().sum()

year                      0
month                     0
circle                    0
type_of_connection        0
service_provider          0
value                 12332
unit                      0
notes                 70217
dtype: int64

In [36]:
df['value'] = pd.to_numeric(df['value'], errors='coerce')
df.dtypes

year                    int64
month                  object
circle                 object
type_of_connection     object
service_provider       object
value                 float64
unit                   object
notes                  object
dtype: object

In [39]:
print(df['value'].max())
print(df['value'].min())

476527220.0
0.0